# https://level.goorm.io/exam/49112/%EC%A7%95%EA%B2%80%EB%8B%A4%EB%A6%AC-%EA%B1%B4%EB%84%88%EA%B8%B0/quiz/1
# 징검다리 <dp: 동적계획법> 
# 
# [문제]
# 0. 용민이가 독극물이 최대한 묻지 않도록 걷너뛰며 돌을 밟았다고 가정했을때,
# 1. 용민이에게 묻는 독극물의 양은 얼마인가?
# 2. 최대 3칸씩 건너뛸 수 있다.
# 
# --------------------------------------------------------------------------
N = int(input())
stones = list(map(int,input().split()))

dp = [0]*N
# 최대 3칸 뛸 수 있으므로 3개까지는 가능하다.
dp[0]=stones[0]
dp[1]=stones[1]
dp[2]=stones[2]
# 이전 인덱스 확인하고 세개중에 작은거 더해주면 끝
for i in range(3,N):
	dp[i]=stones[i] + min(dp[i-1],dp[i-2],dp[i-3])

print(min(dp[len(dp)-1],dp[len(dp)-2],dp[len(dp)-3]))

# --------------------------------------------------------------------------

# 20
# [20, 29, 10, 28, 3, 25, 35, 36, 16, 11, 7, 30, 37, 10, 39, 3, 13, 26, 34, 37]

# [20, 29, 10, 38, 13, 35, 48, 49, 51, 59, 56, 81, 93, 66, 105, 69, 79, 95, 103, 116]